Revit 2027 API
ElectricalAnalyticalNode.TotalLoad Property
 The Total Connected Load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalLoad { get; }
Public ReadOnly Property TotalLoad As Double
	Get
public:
property double TotalLoad {
	double get ();
}
member TotalLoad : float with get
Property Value
Double
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace